#### Environment: `dev`
#### Terraform Plan 📋
```
module.network.google_compute_network.vpc: Refreshing state... [id=projects/kip-dev-487617-t9/global/networks/kip-dev-vpc]
module.network.google_compute_router.router: Refreshing state... [id=projects/kip-dev-487617-t9/regions/us-central1/routers/kip-dev-router]
module.network.google_compute_subnetwork.subnet: Refreshing state... [id=projects/kip-dev-487617-t9/regions/us-central1/subnetworks/kip-dev-subnet]
module.network.google_compute_router_nat.nat: Refreshing state... [id=kip-dev-487617-t9/us-central1/kip-dev-router/kip-dev-nat]
module.gke.google_container_cluster.cluster: Refreshing state... [id=projects/kip-dev-487617-t9/locations/us-central1/clusters/kip-dev-cluster]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke.google_container_cluster.cluster has changed
  ~ resource "google_container_cluster" "cluster" {
      + endpoint                                 = "35.223.125.65"
        id                                       = "projects/kip-dev-487617-t9/locations/us-central1/clusters/kip-dev-cluster"
        name                                     = "kip-dev-cluster"
        # (15 unchanged attributes hidden)

      + master_auth {
          + cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUtpbWdhQUlDSVpTWXptRGVSSEVyQ3d3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1ptVXlPR000WVRrdE5qRmxZeTAwWmpBeUxXRmtNREV0TmpCa09UQmlNalpsWTJNdwpNQ0FYRFRJMk1ESXhOakl6TURJeU5Wb1lEekl3TlRZd01qRXdNREF3TWpJMVdqQXZNUzB3S3dZRFZRUURFeVJtClpUSTRZemhoT1MwMk1XVmpMVFJtTURJdFlXUXdNUzAyTUdRNU1HSXlObVZqWXpBd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDK1JycVhiWUlpd09rbGt5MDd4VHVKTDRTQVVydkdaS1VTL1BsbApnWVQ1YnlhWGUwVFdaTU9KSW9ON1ZmV2xLRHJydVpoRGpYY1NGQ0VidHZzbGZJajFoQ1Nnby92Um50aEw5MWpyCk1INTh5WjdSYmd6ZmgvVm14M3FCWnJWU2EvN0hFeE93STh5YXhPenpDT2tKUmw5S1ZUanVlWnc1enJFOHpIRnUKdGhjOVVua0tydFR5OGtaN1hYRnFyaUJjUmk4eU45c0xsdmJ3ODV4ZmROUE0rRVRmS1lTdWd2K1hZVWliV1RuUgpLUnRiWVZQUkJaei9lNmhYYklJMFpOOXR2OWJLaktaQyt4NElMNkY1SmJ3aEhBYlNqVEN0Ri8vOGI0QzhtVGV2CmtGUVNHdG9mSTUrbVV5eEs1MUhsYXBFSTltcTFtMnVXdHZKUXREZ0Rvd0taYjFRQTJ3NWFCdzBON2tWTWRaenIKcS9KYk5pYmhJUjhieExUMmhBVXpBbUF5V3l6VTlyUTNIcnRJYWNGSWVEdnU5bEFjaWR4eEdjZ3FCenFiUDhwWAo1eVN0ZjlBZ2NLd1g4bVdwRXpEM3ZDZHhxcW5hbFdYeFdrYnZoT1RQWStmTElDL0YyVm1JTzNrNnIvaDJYRzdJCjlCblo0VGJOWCtxME9YdGh1aU15K05uWnNXc0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSXpXOWN4SnprSnMwbEJXUlB0QUV4NXRScVY0TUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQk5IUmt1ZnJPWnM2MGx4ZWVBZnk4SHBPSXhjOEV1ZldtTHB0RFQvd2N6ClVCT2ZrZUN0cnNnL0wrNFBVVFh3Tm94Z3JJTUNONEphUkZ5Ly84M1BYY2FURGZGaDYrZTFCZENMQWtIR1lPZm8KUlZlQndEYmFLYk4wT1dVZGhoa1lzcElIMUE1Z2NoNVZ4b3cwVE92N0tnN3NFSU84RWtJRG1TbGFKZVF4NktWTQo2MDlELy8vS212UEFOVGVQb3cwQVdXdSt0cWpVdUt1aUZqamZOeGw0RDlJUndyMjFYOGQyeXV1VU50TWF3Nm16Cm1kR3NQQ0FxZE93cXRIOG1MbFgrWCt5MEswQ0dObE16UkFyM05PQXhROUJ0S0FSbzRtNEk2dHpkdXIvZmhjbEEKdndvY0FONXVQVjVQRlNCTTFIYk5ieW4reDhEN0I2eGgzblo1RGlNTkRLNU5Mbi91NnBWRlRNdlBwWjJFNEdMdApYQjlkRW9TQ1lOS01tQlRkMGhGenMrUUVsaEJidjlncHRkRUs1ZFUrd2ZuTmlMdTBIL3NUellNQ0VUbjg4M2YrCnZEdHcyVGRuQVlPTEFDdWpFR0RDRzFQTE5udHJyNTl1REFIYTlCNk5kSXVlTDdQSlFXTC9FYVcxUUlIMmdVVUsKamYwbVFodjMzYjBqNTZoZnM4bUowUWs9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
        }

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.cluster is tainted, so must be replaced
-/+ resource "google_container_cluster" "cluster" {
      ~ cluster_ipv4_cidr                        = "10.4.0.0/14" -> (known after apply)
      + datapath_provider                        = (known after apply)
      ~ default_max_pods_per_node                = 110 -> (known after apply)
      - enable_autopilot                         = false -> null
      ~ enable_intranode_visibility              = false -> (known after apply)
      - enable_tpu                               = false -> null
      ~ endpoint                                 = "35.223.125.65" -> (known after apply)
      ~ id                                       = "projects/kip-dev-487617-t9/locations/us-central1/clusters/kip-dev-cluster" -> (known after apply)
      ~ label_fingerprint                        = "a9dc16a7" -> (known after apply)
      ~ logging_service                          = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version                           = "1.34.3-gke.1051003" -> (known after apply)
      ~ monitoring_service                       = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                                     = "kip-dev-cluster"
      ~ networking_mode                          = "VPC_NATIVE" -> (known after apply)
      ~ node_locations                           = [
          - "us-central1-a",
          - "us-central1-b",
          - "us-central1-c",
        ] -> (known after apply)
      ~ node_version                             = "1.34.3-gke.1051003" -> (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      - resource_labels                          = {} -> null
      ~ self_link                                = "https://container.googleapis.com/v1/projects/kip-dev-487617-t9/locations/us-central1/clusters/kip-dev-cluster" -> (known after apply)
      ~ services_ipv4_cidr                       = "10.8.0.0/20" -> (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)
        # (13 unchanged attributes hidden)

      - addons_config {
          - dns_cache_config {
              - enabled = true -> null
            }
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = false -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - auto_provisioning_locations = [] -> null
          - autoscaling_profile         = "BALANCED" -> null
          - enabled                     = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.4.0.0/14" -> (known after apply)
          ~ services_ipv4_cidr_block      = "10.8.0.0/20" -> (known after apply)
            # (3 unchanged attributes hidden)

          - pod_cidr_overprovision_config {
              - disabled = false -> null
            }
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUtpbWdhQUlDSVpTWXptRGVSSEVyQ3d3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1ptVXlPR000WVRrdE5qRmxZeTAwWmpBeUxXRmtNREV0TmpCa09UQmlNalpsWTJNdwpNQ0FYRFRJMk1ESXhOakl6TURJeU5Wb1lEekl3TlRZd01qRXdNREF3TWpJMVdqQXZNUzB3S3dZRFZRUURFeVJtClpUSTRZemhoT1MwMk1XVmpMVFJtTURJdFlXUXdNUzAyTUdRNU1HSXlObVZqWXpBd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDK1JycVhiWUlpd09rbGt5MDd4VHVKTDRTQVVydkdaS1VTL1BsbApnWVQ1YnlhWGUwVFdaTU9KSW9ON1ZmV2xLRHJydVpoRGpYY1NGQ0VidHZzbGZJajFoQ1Nnby92Um50aEw5MWpyCk1INTh5WjdSYmd6ZmgvVm14M3FCWnJWU2EvN0hFeE93STh5YXhPenpDT2tKUmw5S1ZUanVlWnc1enJFOHpIRnUKdGhjOVVua0tydFR5OGtaN1hYRnFyaUJjUmk4eU45c0xsdmJ3ODV4ZmROUE0rRVRmS1lTdWd2K1hZVWliV1RuUgpLUnRiWVZQUkJaei9lNmhYYklJMFpOOXR2OWJLaktaQyt4NElMNkY1SmJ3aEhBYlNqVEN0Ri8vOGI0QzhtVGV2CmtGUVNHdG9mSTUrbVV5eEs1MUhsYXBFSTltcTFtMnVXdHZKUXREZ0Rvd0taYjFRQTJ3NWFCdzBON2tWTWRaenIKcS9KYk5pYmhJUjhieExUMmhBVXpBbUF5V3l6VTlyUTNIcnRJYWNGSWVEdnU5bEFjaWR4eEdjZ3FCenFiUDhwWAo1eVN0ZjlBZ2NLd1g4bVdwRXpEM3ZDZHhxcW5hbFdYeFdrYnZoT1RQWStmTElDL0YyVm1JTzNrNnIvaDJYRzdJCjlCblo0VGJOWCtxME9YdGh1aU15K05uWnNXc0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSXpXOWN4SnprSnMwbEJXUlB0QUV4NXRScVY0TUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQk5IUmt1ZnJPWnM2MGx4ZWVBZnk4SHBPSXhjOEV1ZldtTHB0RFQvd2N6ClVCT2ZrZUN0cnNnL0wrNFBVVFh3Tm94Z3JJTUNONEphUkZ5Ly84M1BYY2FURGZGaDYrZTFCZENMQWtIR1lPZm8KUlZlQndEYmFLYk4wT1dVZGhoa1lzcElIMUE1Z2NoNVZ4b3cwVE92N0tnN3NFSU84RWtJRG1TbGFKZVF4NktWTQo2MDlELy8vS212UEFOVGVQb3cwQVdXdSt0cWpVdUt1aUZqamZOeGw0RDlJUndyMjFYOGQyeXV1VU50TWF3Nm16Cm1kR3NQQ0FxZE93cXRIOG1MbFgrWCt5MEswQ0dObE16UkFyM05PQXhROUJ0S0FSbzRtNEk2dHpkdXIvZmhjbEEKdndvY0FONXVQVjVQRlNCTTFIYk5ieW4reDhEN0I2eGgzblo1RGlNTkRLNU5Mbi91NnBWRlRNdlBwWjJFNEdMdApYQjlkRW9TQ1lOS01tQlRkMGhGenMrUUVsaEJidjlncHRkRUs1ZFUrd2ZuTmlMdTBIL3NUellNQ0VUbjg4M2YrCnZEdHcyVGRuQVlPTEFDdWpFR0RDRzFQTE5udHJyNTl1REFIYTlCNk5kSXVlTDdQSlFXTC9FYVcxUUlIMmdVVUsKamYwbVFodjMzYjBqNTZoZnM4bUowUWs9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "HPA",
              - "POD",
              - "DAEMONSET",
              - "DEPLOYMENT",
              - "STATEFULSET",
              - "JOBSET",
              - "STORAGE",
              - "CADVISOR",
              - "KUBELET",
              - "DCGM",
            ] -> null

          - advanced_datapath_observability_config {
              - enable_metrics = false -> null
              - enable_relay   = false -> null
              - relay_mode     = "DISABLED" -> null
            }

          - managed_prometheus {
              - enabled = true -> null
            }
        }

      ~ node_config {
          ~ disk_size_gb                = 100 -> 20
          ~ disk_type                   = "pd-balanced" -> (known after apply)
          ~ effective_taints            = [] -> (known after apply)
          - enable_confidential_storage = false -> null
          ~ guest_accelerator           = [] -> (known after apply)
          ~ image_type                  = "COS_CONTAINERD" -> (known after apply)
          ~ labels                      = {} -> (known after apply)
          ~ local_ssd_count             = 0 -> (known after apply)
          ~ logging_variant             = "DEFAULT" -> (known after apply)
          ~ machine_type                = "e2-medium" -> (known after apply)
          ~ metadata                    = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform            = (known after apply)
          ~ oauth_scopes                = [
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
              - "https://www.googleapis.com/auth/service.management.readonly",
              - "https://www.googleapis.com/auth/servicecontrol",
              - "https://www.googleapis.com/auth/trace.append",
            ] -> (known after apply)
          - resource_labels             = {
              - "goog-gke-node-pool-provisioning-model" = "on-demand"
            } -> null
          - resource_manager_tags       = {} -> null
          ~ service_account             = "default" -> (known after apply)
          ~ spot                        = false -> true
          - tags                        = [] -> null
            # (1 unchanged attribute hidden)

          - kubelet_config {
              - cpu_cfs_quota                          = false -> null
              - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
              - pod_pids_limit                         = 0 -> null
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - node_pool {
          - initial_node_count          = 1 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/kip-dev-487617-t9/zones/us-central1-a/instanceGroupManagers/gke-kip-dev-cluster-default-pool-7eed2434-grp",
              - "https://www.googleapis.com/compute/v1/projects/kip-dev-487617-t9/zones/us-central1-b/instanceGroupManagers/gke-kip-dev-cluster-default-pool-8ffc520c-grp",
              - "https://www.googleapis.com/compute/v1/projects/kip-dev-487617-t9/zones/us-central1-c/instanceGroupManagers/gke-kip-dev-cluster-default-pool-35669c9a-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/kip-dev-487617-t9/zones/us-central1-a/instanceGroups/gke-kip-dev-cluster-default-pool-7eed2434-grp",
              - "https://www.googleapis.com/compute/v1/projects/kip-dev-487617-t9/zones/us-central1-b/instanceGroups/gke-kip-dev-cluster-default-pool-8ffc520c-grp",
              - "https://www.googleapis.com/compute/v1/projects/kip-dev-487617-t9/zones/us-central1-c/instanceGroups/gke-kip-dev-cluster-default-pool-35669c9a-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "default-pool" -> null
          - node_count                  = 1 -> null
          - node_locations              = [
              - "us-central1-a",
              - "us-central1-b",
              - "us-central1-c",
            ] -> null
          - version                     = "1.34.3-gke.1051003" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = true -> null
              - pod_ipv4_cidr_block  = "10.4.0.0/14" -> null
              - pod_range            = "pods" -> null
            }

          - node_config {
              - disk_size_gb                = 100 -> null
              - disk_type                   = "pd-balanced" -> null
              - effective_taints            = [] -> null
              - enable_confidential_storage = false -> null
              - guest_accelerator           = [] -> null
              - image_type                  = "COS_CONTAINERD" -> null
              - labels                      = {} -> null
              - local_ssd_count             = 0 -> null
              - logging_variant             = "DEFAULT" -> null
              - machine_type                = "e2-medium" -> null
              - metadata                    = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes                = [
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                  - "https://www.googleapis.com/auth/service.management.readonly",
                  - "https://www.googleapis.com/auth/servicecontrol",
                  - "https://www.googleapis.com/auth/trace.append",
                ] -> null
              - preemptible                 = false -> null
              - resource_labels             = {
                  - "goog-gke-node-pool-provisioning-model" = "on-demand"
                } -> null
              - resource_manager_tags       = {} -> null
              - service_account             = "default" -> null
              - spot                        = false -> null
              - tags                        = [] -> null

              - kubelet_config {
                  - cpu_cfs_quota                          = false -> null
                  - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
                  - pod_pids_limit                         = 0 -> null
                }

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - mode = "GKE_METADATA" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_auto_config {
          - resource_manager_tags = {} -> null

          - node_kubelet_config {
              - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - insecure_kubelet_readonly_port_enabled = "FALSE" -> null
              - logging_variant                        = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      ~ private_cluster_config {
          - enable_private_endpoint = false -> null
          + peering_name            = (known after apply)
          ~ private_endpoint        = "172.16.0.2" -> (known after apply)
          ~ public_endpoint         = "35.223.125.65" -> (known after apply)
            # (2 unchanged attributes hidden)

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - security_posture_config {
          - mode               = "BASIC" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }

        # (3 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.default will be created
  + resource "google_container_node_pool" "default" {
      + cluster                     = "kip-dev-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "kip-dev-default-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "kip-dev-487617-t9"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 2
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 20
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = true

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + cluster_endpoint = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @mingjie-li on `4652437bc75da745b0a299c53011dea31945cfb6`*